foxval/esp-idf/components/soc/esp32c/include/soc/uart_reg.h
#define UART_MEM_TX_STATUS_REG(i)          (REG_UART_BASE(i) + 0x5c)
/* UART_TX_RADDR : RO ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define UART_TX_RADDR  0x000007FF
#define UART_TX_RADDR_M  ((UART_TX_RADDR_V)<<(UART_TX_RADDR_S))
#define UART_TX_RADDR_V  0x7FF
#define UART_TX_RADDR_S  11
/* UART_APB_TX_WADDR : RO ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define UART_APB_TX_WADDR  0x000007FF
#define UART_APB_TX_WADDR_M  ((UART_APB_TX_WADDR_V)<<(UART_APB_TX_WADDR_S))
#define UART_APB_TX_WADDR_V  0x7FF
#define UART_APB_TX_WADDR_S  0

#define UART_MEM_RX_STATUS_REG(i)          (REG_UART_BASE(i) + 0x60)
/* UART_RX_WADDR : RO ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define UART_RX_WADDR  0x000007FF
#define UART_RX_WADDR_M  ((UART_RX_WADDR_V)<<(UART_RX_WADDR_S))
#define UART_RX_WADDR_V  0x7FF
#define UART_RX_WADDR_S  11
/* UART_APB_RX_RADDR : RO ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define UART_APB_RX_RADDR  0x000007FF
#define UART_APB_RX_RADDR_M  ((UART_APB_RX_RADDR_V)<<(UART_APB_RX_RADDR_S))
#define UART_APB_RX_RADDR_V  0x7FF
#define UART_APB_RX_RADDR_S  0

#define UART_MEM_CNT_STATUS_REG(i)          (REG_UART_BASE(i) + 0x64)
/* UART_TX_MEM_CNT : RO ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: refer to the txfifo_cnt's describtion.*/
#define UART_TX_MEM_CNT  0x00000007
#define UART_TX_MEM_CNT_M  ((UART_TX_MEM_CNT_V)<<(UART_TX_MEM_CNT_S))
#define UART_TX_MEM_CNT_V  0x7
#define UART_TX_MEM_CNT_S  3
/* UART_RX_MEM_CNT : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: refer to the rxfifo_cnt's describtion.*/
#define UART_RX_MEM_CNT  0x00000007
#define UART_RX_MEM_CNT_M  ((UART_RX_MEM_CNT_V)<<(UART_RX_MEM_CNT_S))
#define UART_RX_MEM_CNT_V  0x7
#define UART_RX_MEM_CNT_S  0

#define UART_POSPULSE_REG(i)          (REG_UART_BASE(i) + 0x68)
/* UART_POSEDGE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */
/*description: This register stores the count of rxd posedge edge. it is used
 in boudrate-detect process.*/
#define UART_POSEDGE_MIN_CNT  0x000FFFFF
#define UART_POSEDGE_MIN_CNT_M  ((UART_POSEDGE_MIN_CNT_V)<<(UART_POSEDGE_MIN_CNT_S))
#define UART_POSEDGE_MIN_CNT_V  0xFFFFF
#define UART_POSEDGE_MIN_CNT_S  0

#define UART_NEGPULSE_REG(i)          (REG_UART_BASE(i) + 0x6c)
/* UART_NEGEDGE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */
/*description: This register stores the count of rxd negedge edge. it is used
 in boudrate-detect process.*/
#define UART_NEGEDGE_MIN_CNT  0x000FFFFF
#define UART_NEGEDGE_MIN_CNT_M  ((UART_NEGEDGE_MIN_CNT_V)<<(UART_NEGEDGE_MIN_CNT_S))
#define UART_NEGEDGE_MIN_CNT_V  0xFFFFF
#define UART_NEGEDGE_MIN_CNT_S  0

#define UART_DATE_REG(i)          (REG_UART_BASE(i) + 0x78)
/* UART_DATE : R/W ;bitpos:[31:0] ;default: 32'h15122500 ; */
/*description: */
#define UART_DATE  0xFFFFFFFF
#define UART_DATE_M  ((UART_DATE_V)<<(UART_DATE_S))
#define UART_DATE_V  0xFFFFFFFF
#define UART_DATE_S  0

#define UART_ID_REG(i)          (REG_UART_BASE(i) + 0x7C)
/* UART_ID : R/W ;bitpos:[31:0] ;default: 32'h0500 ; */
/*description: */
#define UART_ID  0xFFFFFFFF
#define UART_ID_M  ((UART_ID_V)<<(UART_ID_S))
#define UART_ID_V  0xFFFFFFFF
#define UART_ID_S  0

#ifdef __cplusplus
}
#endif



#endif /*__UART_REG_H__ */


